Thavi123/Avartan_AICI_Project/AICI.syscfg
/**
 * These arguments were used when this file was generated. They will be automatically applied on subsequent loads
 * via the GUI or CLI. Run CLI with '--help' for additional information on how to override these arguments.
 * @cliArgs --device "F28P65x" --part "F28P65x_100PZP" --package "100PZP" --context "CPU1" --product "C2000WARE@6.00.01.00"
 * @v2CliArgs --device "TMS320F28P650DK" --package "100PZP" --variant "TMS320F28P650DK6" --context "CPU1" --product "C2000WARE@6.00.01.00"
 * @versions {"tool":"1.26.0+4407"}
 */

/**
 * Import the modules used in this configuration.
 */
const adc              = scripting.addModule("/driverlib/adc.js", {}, false);
const adc1             = adc.addInstance();
const adc2             = adc.addInstance();
const adc3             = adc.addInstance();
const asysctl          = scripting.addModule("/driverlib/asysctl.js");
const led              = scripting.addModule("/driverlib/board_components/led", {}, false);
const led1             = led.addInstance();
const led2             = led.addInstance();
const clb              = scripting.addModule("/driverlib/clb.js", {}, false);
const clb1             = clb.addInstance();
const clb_outputxbar   = scripting.addModule("/driverlib/clb_outputxbar.js", {}, false);
const clb_outputxbar1  = clb_outputxbar.addInstance();
const clb_outputxbar2  = clb_outputxbar.addInstance();
const clbxbar          = scripting.addModule("/driverlib/clbxbar.js", {}, false);
const clbxbar1         = clbxbar.addInstance();
const clbxbar2         = clbxbar.addInstance();
const clbxbar3         = clbxbar.addInstance();
const cputimer         = scripting.addModule("/driverlib/cputimer.js", {}, false);
const cputimer1        = cputimer.addInstance();
const dac              = scripting.addModule("/driverlib/dac.js", {}, false);
const dac1             = dac.addInstance();
const dac2             = dac.addInstance();
const epwm             = scripting.addModule("/driverlib/epwm.js", {}, false);
const epwm1            = epwm.addInstance();
const epwm2            = epwm.addInstance();
const epwm3            = epwm.addInstance();
const epwm4            = epwm.addInstance();
const gpio             = scripting.addModule("/driverlib/gpio.js", {}, false);
const gpio3            = gpio.addInstance();
const gpio4            = gpio.addInstance();
const gpio5            = gpio.addInstance();
const gpio6            = gpio.addInstance();
const gpio7            = gpio.addInstance();
const gpio8            = gpio.addInstance();
const gpio9            = gpio.addInstance();
const gpio10           = gpio.addInstance();
const gpio11           = gpio.addInstance();
const gpio12           = gpio.addInstance();
const gpio13           = gpio.addInstance();
const gpio14           = gpio.addInstance();
const gpio15           = gpio.addInstance();
const gpio16           = gpio.addInstance();
const gpio17           = gpio.addInstance();
const gpio18           = gpio.addInstance();
const gpio19           = gpio.addInstance();
const gpio20           = gpio.addInstance();
const gpio21           = gpio.addInstance();
const gpio22           = gpio.addInstance();
const inputxbar_input  = scripting.addModule("/driverlib/inputxbar_input.js", {}, false);
const inputxbar_input1 = inputxbar_input.addInstance();
const inputxbar_input2 = inputxbar_input.addInstance();
const inputxbar_input3 = inputxbar_input.addInstance();
const inputxbar_input4 = inputxbar_input.addInstance();
const inputxbar_input5 = inputxbar_input.addInstance();
const sci              = scripting.addModule("/driverlib/sci.js", {}, false);
const sci1             = sci.addInstance();
const sci2             = sci.addInstance();
const spi              = scripting.addModule("/driverlib/spi.js", {}, false);
const spi1             = spi.addInstance();
const uart             = scripting.addModule("/driverlib/uart.js", {}, false);
const uart1            = uart.addInstance();
const uart2            = uart.addInstance();
const TILE             = scripting.addModule("/utilities/clb_tool/clb_syscfg/source/TILE", {}, false);
const TILE1            = TILE.addInstance();

/**
 * Write custom configuration values to the imported modules.
 */
adc1.$name               = "myADC0";
adc1.soc0Channel         = "ADC_CH_ADCIN1";
adc1.soc1Channel         = "ADC_CH_ADCIN2";
adc1.soc2Channel         = "ADC_CH_ADCIN3";
adc1.soc3Channel         = "ADC_CH_ADCIN4";
adc1.soc4Channel         = "ADC_CH_ADCIN5";
adc1.enabledSOCs         = ["ADC_SOC_NUMBER0","ADC_SOC_NUMBER1","ADC_SOC_NUMBER2","ADC_SOC_NUMBER3","ADC_SOC_NUMBER4","ADC_SOC_NUMBER5","ADC_SOC_NUMBER6","ADC_SOC_NUMBER7"];
adc1.soc5Channel         = "ADC_CH_ADCIN6";
adc1.soc6Channel         = "ADC_CH_ADCIN10";
adc1.soc7Channel         = "ADC_CH_ADCIN11";
adc1.enableInterrupt1    = true;
adc1.interrupt1SOCSource = "ADC_INT_TRIGGER_EOC3";
adc1.registerInterrupts  = ["1"];
adc1.soc0SampleWindow    = 20;
adc1.soc1SampleWindow    = 20;
adc1.soc2SampleWindow    = 20;
adc1.soc3SampleWindow    = 20;
adc1.soc4SampleWindow    = 20;
adc1.soc5SampleWindow    = 20;
adc1.soc6SampleWindow    = 20;
adc1.soc7SampleWindow    = 20;
adc1.adcClockPrescaler   = "ADC_CLK_DIV_6_0";
adc1.useInterrupts       = false;

adc2.$name               = "myADC1";
adc2.adcBase             = "ADCB_BASE";
adc2.soc1Channel         = "ADC_CH_ADCIN2";
adc2.soc2Channel         = "ADC_CH_ADCIN3";
adc2.soc3Channel         = "ADC_CH_ADCIN6";
adc2.soc4Channel         = "ADC_CH_ADCIN7";
adc2.enabledInts         = ["ADC_INT_NUMBER1"];
adc2.interrupt1SOCSource = "ADC_INT_TRIGGER_EOC5";
adc2.enableInterrupt1    = true;
adc2.soc0SampleWindow    = 20;
adc2.soc1SampleWindow    = 20;
adc2.soc2SampleWindow    = 20;
adc2.soc3SampleWindow    = 20;
adc2.soc4SampleWindow    = 20;
adc2.adcClockPrescaler   = "ADC_CLK_DIV_6_0";
adc2.enabledSOCs         = ["ADC_SOC_NUMBER0","ADC_SOC_NUMBER1","ADC_SOC_NUMBER2","ADC_SOC_NUMBER3","ADC_SOC_NUMBER4","ADC_SOC_NUMBER5"];
adc2.soc5Channel         = "ADC_CH_ADCIN6";
adc2.soc5SampleWindow    = 20;
adc2.useInterrupts       = false;

adc3.$name             = "myADC2";
adc3.adcClockPrescaler = "ADC_CLK_DIV_4_0";
adc3.adcResolutionMode = "ADC_RESOLUTION_16BIT";
adc3.adcSignalMode     = "ADC_MODE_DIFFERENTIAL";
adc3.enabledSOCs       = ["ADC_SOC_NUMBER0","ADC_SOC_NUMBER1","ADC_SOC_NUMBER2","ADC_SOC_NUMBER3"];
adc3.soc0Channel       = "ADC_CH_ADCIN0_ADCIN1";
adc3.soc0SampleWindow  = 65;
adc3.soc1Channel       = "ADC_CH_ADCIN2_ADCIN3";
adc3.soc1SampleWindow  = 65;
adc3.soc2Channel       = "ADC_CH_ADCIN4_ADCIN5";
adc3.soc2SampleWindow  = 65;
adc3.soc3Channel       = "ADC_CH_ADCIN14_ADCIN15";
adc3.soc3SampleWindow  = 65;
adc3.adcBase           = "ADCC_BASE";

led1.$name                = "LED";
led1.gpio.gpioPin.$assign = "GPIO65";

led2.$name                = "LED_2";
led2.gpio.gpioPin.$assign = "GPIO85";

clb1.$name               = "myCLB0";
clb1.enableCLB           = true;
clb1.inputTypeCLB_IN0    = "GLOBAL";
clb1.attachTile          = true;
clb1.synchronizeCLB_IN0  = true;
clb1.inputTypeCLB_IN1    = "GLOBAL";
clb1.synchronizeCLB_IN1  = true;
clb1.inputTypeCLB_IN2    = "GLOBAL";
clb1.globalConfigCLB_IN2 = "CLB_GLOBAL_IN_MUX_CLB_AUXSIG2";
clb1.synchronizeCLB_IN2  = true;
clb1.initTile            = true;
clb1.inputsUsed          = ["CLB_IN0","CLB_IN1","CLB_IN2","CLB_IN3","CLB_IN4","CLB_IN5","CLB_IN6","CLB_IN7"];
clb1.globalConfigCLB_IN1 = "CLB_GLOBAL_IN_MUX_EPWM1B";
clb1.synchronizeCLB_IN3  = true;

clb_outputxbar1.$name                                    = "myCLB_OUTPUTXBAR0";
clb_outputxbar1.muxesUsed                                = ["XBAR_MUX00"];
clb_outputxbar1.clb_outputxbar.$assign                   = "CLB_OUTPUTXBAR1";
clb_outputxbar1.clb_outputxbar.clb_outputxbarPin.$assign = "GPIO0";

clb_outputxbar2.$name                                    = "myCLB_OUTPUTXBAR1";
clb_outputxbar2.muxesUsed                                = ["XBAR_MUX01"];
clb_outputxbar2.clb_outputxbar.$assign                   = "CLB_OUTPUTXBAR2";
clb_outputxbar2.clb_outputxbar.clb_outputxbarPin.$assign = "GPIO1";

clbxbar1.$name           = "myCLBXBAR0";
clbxbar1.mux1Config      = "XBAR_CLB_MUX01_INPUTXBAR1_INPUT1";
clbxbar1.mux3Config      = "XBAR_CLB_MUX03_INPUTXBAR1_INPUT2";
clbxbar1.mux9Config      = "XBAR_CLB_MUX09_INPUTXBAR1_INPUT5";
clbxbar1.mux11Config     = "XBAR_CLB_MUX11_INPUTXBAR1_INPUT6";
clbxbar1.sourceSignals   = ["INPUTXBAR1_INPUT4"];
clbxbar1.useSourceSelect = true;

clbxbar2.$name           = "myCLBXBAR1";
clbxbar2.useSourceSelect = true;
clbxbar2.sourceSignals   = ["INPUTXBAR1_INPUT5"];
clbxbar2.auxInput        = "XBAR_AUXSIG1";

clbxbar3.$name           = "myCLBXBAR2";
clbxbar3.auxInput        = "XBAR_AUXSIG2";
clbxbar3.useSourceSelect = true;
clbxbar3.sourceSignals   = ["INPUTXBAR1_INPUT6"];

