Thavi123/Avartan_AICI_Project/AICI.syscfg
const divider4       = system.clockTree["CLBCLKDIV"];
divider4.divideValue = 1;

const divider8       = system.clockTree["EPWMCLKDIV"];
divider8.divideValue = 1;

cputimer1.$name                    = "myCPUTIMER0";
cputimer1.timerPeriod              = 600000000;
cputimer1.enableInterrupt          = true;
cputimer1.registerInterrupts       = true;
cputimer1.startTimer               = true;
cputimer1.timerInt.enableInterrupt = true;

dac1.$name            = "myDAC0";
dac1.enableOutput     = true;
dac1.referenceVoltage = "DAC_REF_ADC_VREFHI";

dac2.$name            = "myDAC1";
dac2.dacBase          = "DACC_BASE";
dac2.enableOutput     = true;
dac2.referenceVoltage = "DAC_REF_ADC_VREFHI";

const analog  = scripting.addModule("/driverlib/analog.js", {}, false);
const analog1 = analog.addInstance({}, false);
analog1.$name = "myANALOGPinMux0";
adc1.analog   = analog1;
adc2.analog   = analog1;
adc3.analog   = analog1;
dac1.analog   = analog1;
dac2.analog   = analog1;

epwm1.epwmTimebase_hsClockDiv                                  = "EPWM_HSCLOCK_DIVIDER_1";
epwm1.epwmTimebase_counterMode                                 = "EPWM_COUNTER_MODE_UP";
epwm1.epwmTimebase_period                                      = 10000;
epwm1.epwmCounterCompare_cmpA                                  = 5000;
epwm1.epwmActionQualifier_EPWM_AQ_OUTPUT_A_ON_TIMEBASE_ZERO    = "EPWM_AQ_OUTPUT_HIGH";
epwm1.epwmActionQualifier_EPWM_AQ_OUTPUT_A_ON_TIMEBASE_UP_CMPA = "EPWM_AQ_OUTPUT_LOW";
epwm1.epwmActionQualifier_EPWM_AQ_OUTPUT_B_ON_TIMEBASE_ZERO    = "EPWM_AQ_OUTPUT_HIGH";
epwm1.epwmActionQualifier_EPWM_AQ_OUTPUT_B_ON_TIMEBASE_UP_CMPB = "EPWM_AQ_OUTPUT_LOW";
epwm1.epwmCounterCompare_cmpB                                  = 5000;
epwm1.$name                                                    = "PWM1";
epwm1.useCase                                                  = "CUSTOM";
epwm1.epwm.$assign                                             = "EPWM1";

epwm2.copyFrom                                                 = "myEPWM0";
epwm2.epwmTimebase_hsClockDiv                                  = "EPWM_HSCLOCK_DIVIDER_1";
epwm2.epwmTimebase_period                                      = 10000;
epwm2.epwmTimebase_counterMode                                 = "EPWM_COUNTER_MODE_UP";
epwm2.epwmCounterCompare_cmpA                                  = 5000;
epwm2.epwmCounterCompare_cmpB                                  = 5000;
epwm2.epwmActionQualifier_EPWM_AQ_OUTPUT_A_ON_TIMEBASE_ZERO    = "EPWM_AQ_OUTPUT_HIGH";
epwm2.epwmActionQualifier_EPWM_AQ_OUTPUT_A_ON_TIMEBASE_UP_CMPA = "EPWM_AQ_OUTPUT_LOW";
epwm2.epwmActionQualifier_EPWM_AQ_OUTPUT_B_ON_TIMEBASE_ZERO    = "EPWM_AQ_OUTPUT_HIGH";
epwm2.epwmActionQualifier_EPWM_AQ_OUTPUT_B_ON_TIMEBASE_UP_CMPB = "EPWM_AQ_OUTPUT_LOW";
epwm2.$name                                                    = "PWM2";
epwm2.epwm.$assign                                             = "EPWM5";
epwm2.epwm.epwm_aPin.$assign                                   = "GPIO59";
epwm2.epwm.epwm_bPin.$assign                                   = "GPIO73";

epwm3.copyFrom                                                 = "myEPWM1";
epwm3.epwmTimebase_hsClockDiv                                  = "EPWM_HSCLOCK_DIVIDER_1";
epwm3.epwmTimebase_period                                      = 10000;
epwm3.epwmTimebase_counterMode                                 = "EPWM_COUNTER_MODE_UP";
epwm3.epwmCounterCompare_cmpA                                  = 5000;
epwm3.epwmCounterCompare_cmpB                                  = 5000;
epwm3.epwmActionQualifier_EPWM_AQ_OUTPUT_A_ON_TIMEBASE_ZERO    = "EPWM_AQ_OUTPUT_HIGH";
epwm3.epwmActionQualifier_EPWM_AQ_OUTPUT_A_ON_TIMEBASE_UP_CMPA = "EPWM_AQ_OUTPUT_LOW";
epwm3.epwmActionQualifier_EPWM_AQ_OUTPUT_B_ON_TIMEBASE_ZERO    = "EPWM_AQ_OUTPUT_HIGH";
epwm3.epwmActionQualifier_EPWM_AQ_OUTPUT_B_ON_TIMEBASE_UP_CMPB = "EPWM_AQ_OUTPUT_LOW";
epwm3.$name                                                    = "PWM3";
epwm3.epwm.$assign                                             = "EPWM3";

epwm4.copyFrom                                                 = "myEPWM1";
epwm4.epwmTimebase_hsClockDiv                                  = "EPWM_HSCLOCK_DIVIDER_1";
epwm4.epwmTimebase_period                                      = 10000;
epwm4.epwmTimebase_counterMode                                 = "EPWM_COUNTER_MODE_UP";
epwm4.epwmCounterCompare_cmpA                                  = 5000;
epwm4.epwmCounterCompare_cmpB                                  = 5000;
epwm4.epwmActionQualifier_EPWM_AQ_OUTPUT_A_ON_TIMEBASE_ZERO    = "EPWM_AQ_OUTPUT_HIGH";
epwm4.epwmActionQualifier_EPWM_AQ_OUTPUT_A_ON_TIMEBASE_UP_CMPA = "EPWM_AQ_OUTPUT_LOW";
epwm4.epwmActionQualifier_EPWM_AQ_OUTPUT_B_ON_TIMEBASE_ZERO    = "EPWM_AQ_OUTPUT_HIGH";
epwm4.epwmActionQualifier_EPWM_AQ_OUTPUT_B_ON_TIMEBASE_UP_CMPB = "EPWM_AQ_OUTPUT_LOW";
epwm4.$name                                                    = "PWM4";

gpio3.$name                     = "PS1";
gpio3.padConfig                 = "PULLUP";
gpio3.qualMode                  = "GPIO_QUAL_ASYNC";
gpio3.useInterrupt              = true;
gpio3.initialValue              = 1;
gpio3.gpioPin.$assign           = "GPIO11";
gpio3.xint.enableInt            = true;
gpio3.xint.registerInterrupts   = true;
gpio3.xint.xInt.enableInterrupt = true;

gpio4.$name                     = "PS3";
gpio4.padConfig                 = "PULLUP";
gpio4.useInterrupt              = true;
gpio4.qualMode                  = "GPIO_QUAL_ASYNC";
gpio4.initialValue              = 1;
gpio4.gpioPin.$assign           = "GPIO13";
gpio4.xint.xintNum              = "GPIO_INT_XINT3";
gpio4.xint.enableInt            = true;
gpio4.xint.registerInterrupts   = true;
gpio4.xint.intType              = "GPIO_INT_TYPE_RISING_EDGE";
gpio4.xint.xInt.enableInterrupt = true;

gpio5.$name                     = "PS4";
gpio5.padConfig                 = "PULLUP";
gpio5.useInterrupt              = true;
gpio5.qualMode                  = "GPIO_QUAL_ASYNC";
gpio5.gpioPin.$assign           = "GPIO14";
gpio5.xint.xintNum              = "GPIO_INT_XINT4";
gpio5.xint.enableInt            = true;
gpio5.xint.registerInterrupts   = true;
gpio5.xint.xInt.enableInterrupt = true;

gpio6.$name                     = "PS5";
gpio6.padConfig                 = "PULLUP";
gpio6.useInterrupt              = true;
gpio6.qualMode                  = "GPIO_QUAL_ASYNC";
gpio6.gpioPin.$assign           = "GPIO15";
gpio6.xint.xintNum              = "GPIO_INT_XINT5";
gpio6.xint.enableInt            = true;
gpio6.xint.registerInterrupts   = true;
gpio6.xint.xInt.enableInterrupt = true;

gpio7.padConfig       = "PULLUP";
gpio7.qualMode        = "GPIO_QUAL_ASYNC";
gpio7.$name           = "OC_A";
gpio7.gpioPin.$assign = "GPIO58";

gpio8.padConfig       = "PULLUP";
gpio8.qualMode        = "GPIO_QUAL_ASYNC";
gpio8.$name           = "OC_B";
gpio8.gpioPin.$assign = "GPIO41";

gpio9.padConfig       = "PULLUP";
gpio9.$name           = "CC_A";
gpio9.gpioPin.$assign = "GPIO61";

gpio10.padConfig       = "PULLUP";
gpio10.$name           = "CC_B";
gpio10.gpioPin.$assign = "GPIO62";

gpio11.padConfig       = "PULLUP";
gpio11.$name           = "CC_C";
gpio11.gpioPin.$assign = "GPIO63";

gpio12.padConfig       = "PULLUP";
gpio12.$name           = "CC_D";
gpio12.gpioPin.$assign = "GPIO64";

