Thavi123/Avartan_AICI_Project/AICI.syscfg
gpio13.$name             = "RELAY";
gpio13.writeInitialValue = true;
gpio13.direction         = "GPIO_DIR_MODE_OUT";
gpio13.gpioPin.$assign   = "GPIO10";

gpio14.$name           = "PFC";
gpio14.direction       = "GPIO_DIR_MODE_OUT";
gpio14.gpioPin.$assign = "GPIO66";

gpio15.$name           = "SW";
gpio15.gpioPin.$assign = "GPIO25";

gpio16.$name           = "ENC_B";
gpio16.gpioPin.$assign = "GPIO80";

gpio17.$name = "ENC_A";

gpio18.$name           = "FAN_TACH";
gpio18.gpioPin.$assign = "GPIO69";

gpio19.padConfig       = "PULLUP";
gpio19.qualMode        = "GPIO_QUAL_ASYNC";
gpio19.$name           = "OC_C";
gpio19.gpioPin.$assign = "GPIO35";

gpio20.padConfig       = "PULLUP";
gpio20.qualMode        = "GPIO_QUAL_ASYNC";
gpio20.$name           = "OC_D";
gpio20.gpioPin.$assign = "GPIO34";

gpio21.$name                     = "PS2";
gpio21.padConfig                 = "PULLUP";
gpio21.qualMode                  = "GPIO_QUAL_ASYNC";
gpio21.useInterrupt              = true;
gpio21.initialValue              = 1;
gpio21.gpioPin.$assign           = "GPIO12";
gpio21.xint.xintNum              = "GPIO_INT_XINT2";
gpio21.xint.enableInt            = true;
gpio21.xint.registerInterrupts   = true;
gpio21.xint.xInt.enableInterrupt = true;

gpio22.$name           = "IGBT_DRIVE";
gpio22.gpioPin.$assign = "GPIO30";

inputxbar_input1.$name          = "myINPUTXBARINPUT0";
inputxbar_input1.inputxbarInput = "XBAR_INPUT4";
inputxbar_input1.inputxbarGpio  = "GPIO11";
gpio3.xint.inputxbar            = inputxbar_input1;

inputxbar_input2.$name          = "myINPUTXBARINPUT1";
inputxbar_input2.inputxbarInput = "XBAR_INPUT5";
inputxbar_input2.inputxbarGpio  = "GPIO12";
gpio21.xint.inputxbar           = inputxbar_input2;

inputxbar_input3.$name          = "myINPUTXBARINPUT2";
inputxbar_input3.inputxbarInput = "XBAR_INPUT6";
inputxbar_input3.inputxbarGpio  = "GPIO13";
gpio4.xint.inputxbar            = inputxbar_input3;

inputxbar_input4.$name          = "myINPUTXBARINPUT3";
inputxbar_input4.inputxbarInput = "XBAR_INPUT13";
gpio5.xint.inputxbar            = inputxbar_input4;
inputxbar_input4.inputxbarGpio  = "GPIO14";

inputxbar_input5.$name          = "myINPUTXBARINPUT4";
inputxbar_input5.inputxbarInput = "XBAR_INPUT14";
gpio6.xint.inputxbar            = inputxbar_input5;
inputxbar_input5.inputxbarGpio  = "GPIO15";

sci1.$name                 = "mySCI0";
sci1.sci.$assign           = "SCIB";
sci1.sci.sci_rxPin.$assign = "GPIO87";
sci1.sci.sci_txPin.$assign = "GPIO86";
sci1.rxQual.$name          = "myGPIOQUAL4";
sci1.txQual.$name          = "myGPIOQUAL5";

sci2.$name                 = "mySCI1";
sci2.rxFifo                = "SCI_FIFO_RX1";
sci2.sci.$assign           = "SCIA";
sci2.sci.sci_rxPin.$assign = "GPIO43";
sci2.sci.sci_txPin.$assign = "GPIO42";
sci2.rxQual.$name          = "myGPIOQUAL6";
sci2.txQual.$name          = "myGPIOQUAL7";

spi1.$name                   = "mySPI0";
spi1.spi.spi_picoPin.$assign = "GPIO91";
spi1.spi.spi_pociPin.$assign = "GPIO92";
spi1.spi.spi_clkPin.$assign  = "GPIO90";
spi1.spi.spi_ptePin.$assign  = "GPIO89";
spi1.picoQual.$name          = "myGPIOQUAL8";
spi1.pociQual.$name          = "myGPIOQUAL9";
spi1.clkQual.$name           = "myGPIOQUAL10";
spi1.pteQual.$name           = "myGPIOQUAL11";

uart1.$name                   = "myUART0";
uart1.uart.uart_txPin.$assign = "GPIO70";
uart1.uart.uart_rxPin.$assign = "GPIO71";
uart1.txQual.$name            = "myGPIOQUAL0";
uart1.rxQual.$name            = "myGPIOQUAL1";

uart2.$name                   = "myUART1";
uart2.uart.uart_txPin.$assign = "GPIO2";
uart2.uart.uart_rxPin.$assign = "GPIO3";
uart2.txQual.$name            = "myGPIOQUAL2";
uart2.rxQual.$name            = "myGPIOQUAL3";

TILE1.$name                = "TILE0";
clb1.tile                  = TILE1;
TILE1.BOUNDARY.$name       = "BOUNDARY0";
TILE1.LUT_0.$name          = "LUT_0";
TILE1.LUT_0.eqn            = "i0";
TILE1.LUT_0.i0             = "BOUNDARY.in0";
TILE1.LUT_1.$name          = "LUT_1";
TILE1.LUT_1.eqn            = "i1";
TILE1.LUT_1.i1             = "BOUNDARY.in1";
TILE1.LUT_2.$name          = "LUT_2";
TILE1.FSM_0.$name          = "FSM_0";
TILE1.FSM_1.$name          = "FSM_1";
TILE1.FSM_2.$name          = "FSM_2";
TILE1.COUNTER_0.$name      = "COUNTER_0";
TILE1.COUNTER_0.match1_val = "";
TILE1.COUNTER_0.match2_val = "";
TILE1.COUNTER_1.$name      = "COUNTER_1";
TILE1.COUNTER_2.$name      = "COUNTER_2";
TILE1.OUTLUT_0.$name       = "OUTLUT_0";
TILE1.OUTLUT_0.eqn         = "!i0";
TILE1.OUTLUT_0.i0          = "LUT_0.OUT";
TILE1.OUTLUT_1.$name       = "OUTLUT_1";
TILE1.OUTLUT_1.eqn         = "i0";
TILE1.OUTLUT_1.i0          = "LUT_1.OUT";
TILE1.OUTLUT_2.$name       = "OUTLUT_2";
TILE1.OUTLUT_3.$name       = "OUTLUT_3";
TILE1.OUTLUT_4.$name       = "OUTLUT_4";
TILE1.OUTLUT_5.$name       = "OUTLUT_5";
TILE1.OUTLUT_6.$name       = "OUTLUT_6";
TILE1.OUTLUT_7.$name       = "OUTLUT_7";
TILE1.HLC.$name            = "HLC_0";
TILE1.HLC.program0.$name   = "HLCP_0";
TILE1.HLC.program1.$name   = "HLCP_1";
TILE1.HLC.program2.$name   = "HLCP_2";
TILE1.HLC.program3.$name   = "HLCP_3";
TILE1.AOC_0.$name          = "AOC_0";
TILE1.AOC_1.$name          = "AOC_1";
TILE1.AOC_2.$name          = "AOC_2";
TILE1.AOC_3.$name          = "AOC_3";
TILE1.AOC_4.$name          = "AOC_4";
TILE1.AOC_5.$name          = "AOC_5";
TILE1.AOC_6.$name          = "AOC_6";
TILE1.AOC_7.$name          = "AOC_7";

/**
 * Pinmux solution for unlocked pins/peripherals. This ensures that minor changes to the automatic solver in a future
 * version of the tool will not impact the pinmux you originally saw.  These lines can be completely deleted in order to
 * re-solve from scratch.
 */
analog1.analog.$suggestSolution                    = "ANALOG";
analog1.analog["a0/daca_outPin"].$suggestSolution  = "A0/DACA_OUT";
analog1.analog.a1Pin.$suggestSolution              = "A1";
analog1.analog["a10, gpio213Pin"].$suggestSolution = "A10, GPIO213";
analog1.analog["a11, gpio214Pin"].$suggestSolution = "A11, GPIO214";
analog1.analog["a14/b14/c14Pin"].$suggestSolution  = "A14/B14/C14";
analog1.analog["a15/b15/c15Pin"].$suggestSolution  = "A15/B15/C15";
analog1.analog.a2Pin.$suggestSolution              = "A2";
analog1.analog.a3Pin.$suggestSolution              = "A3";
analog1.analog.a4Pin.$suggestSolution              = "A4";
analog1.analog.a5Pin.$suggestSolution              = "A5";
analog1.analog["a6, gpio209Pin"].$suggestSolution  = "A6, GPIO209";
analog1.analog["b0/vdacPin"].$suggestSolution      = "B0/VDAC";
analog1.analog["b1/dacc_outPin"].$suggestSolution  = "B1/DACC_OUT";
analog1.analog.b2Pin.$suggestSolution              = "B2";
analog1.analog.b3Pin.$suggestSolution              = "B3";
analog1.analog["b6, gpio207Pin"].$suggestSolution  = "B6, GPIO207";
analog1.analog["b7, gpio208Pin"].$suggestSolution  = "B7, GPIO208";
analog1.analog["c0, gpio199Pin"].$suggestSolution  = "C0, GPIO199";
analog1.analog.c2Pin.$suggestSolution              = "C2";
analog1.analog["c3, gpio206Pin"].$suggestSolution  = "C3, GPIO206";
analog1.analog["c4, gpio205Pin"].$suggestSolution  = "C4, GPIO205";
analog1.analog["c5, gpio204Pin"].$suggestSolution  = "C5, GPIO204";
analog1.analog["c6, gpio203Pin"].$suggestSolution  = "C6, GPIO203";
analog1.analog["c1, gpio200Pin"].$suggestSolution  = "C1, GPIO200";
epwm3.epwm.epwm_aPin.$suggestSolution              = "GPIO4";
epwm3.epwm.epwm_bPin.$suggestSolution              = "GPIO60";
epwm4.epwm.$suggestSolution                        = "EPWM4";
epwm4.epwm.epwm_aPin.$suggestSolution              = "GPIO46";
epwm4.epwm.epwm_bPin.$suggestSolution              = "GPIO47";
gpio17.gpioPin.$suggestSolution                    = "GPIO100";
spi1.spi.$suggestSolution                          = "SPID";
uart1.uart.$suggestSolution                        = "UARTB";
uart2.uart.$suggestSolution                        = "UARTA";
